{
    "template": {
        "endpoint" : "/api/",
        "method" : "GET",
        "parameters": [
            {
                "name": "number",
                "en": " natural number",
                "de": "natürliche Zahl"
            },
            {
                "name": "colour",
                "en": " hexcode of an colour",
                "de": "Hexcode einer Farbe"
            }
        ],
        "title": {
            "en" : "Template",
            "de": "Template"
        },
        "description": {
            "en" : "Here has to be a description of the endpoint.",
            "de": "Hier muss eine Beschreibung des Endpoints stehen."
        }
    },
    "amount-of-women": {
        "endpoint": "/api/amount-of-women",
        "method" : "GET",
        "parameters": [],
        "title": {
            "en" : "Total amount of women",
            "de": "Gesamtanzahl der Frauen"
        },
        "description": {
            "en" : "Returns integer representing the total amount of women in the database.",
            "de": "Es wird eine Ganzzahl zurückgegeben, die die Gesamtzahl aller Frauen im Datensatz angibt."
        }
    },
    "sexes": {
        "endpoint": "/api/genders",
        "method" : "GET",
        "parameters": [],
        "title": {
            "en" : "Gender distribution",
            "de": "Geschlechterverteilung"
        },
        "description": {
            "en" : "Returns a JSON containing all genders and their frequency in the database.",
            "de": "Es wird eine JSON zurückgegeben, die alle Geschlechter und ihre Häufigkeiten im Datensatz enthält."
        }
    },
    "professionlist": {
        "endpoint" : "/api/professions/list",
        "method" : "GET",
        "parameters": [],
        "title": {
            "en" : "Complete list of professions",
            "de": "Vollständige Liste aller Berufe"
        },
        "description": {
            "en" : "Returns a json-like list containing all professions.",
            "de": "Es wird eine Json-Liste zurückgegeben, die alle Berufe enthält."
        }
    },
    "professions": {
        "endpoint" : "/api/professions",
        "method" : "GET",
        "parameters": [
            {
                "name": "gender",
                "en": "Possible arguments are male, female or unknown.",
                "de": "Mögliche Argumente sind male, female oder unknown."
            },
            {
                "name": "name",
                "en": "Profession title. You can get a list of all professions by calling <a href='/api/professions/list' target='_blank' rel='noreferrer'><code>/api/professions/list</code></a>.",
                "de": "Berufsbezeichnung. Eine Liste aller Berufe ist verfügbar an <a href='/api/professions/list' target='_blank' rel='noreferrer'><code>/api/professions/list</code></a>."
            }
        ],
        "title": {
            "en" : "Gender distributions of professsions",
            "de": "Geschlechterverteilung der Berufe"
        },
        "description": {
            "en" : "Returns a json containing the professions as key and the frequency of genders as value. <br>If <code>gender</code> is given as a parameter, then the value of the json only contains the frequencies of the specified gender. <br>If <code>name</code> is given as a parameter, then the json contains only the specified profession with all gender frequencies. <br> If both parameters are given, then the response contains a number of the amount of persons of the specified gender that worked in the specified profession.",
            "de": "Zurückgegeben wird eine Json, die alle Berufe als key enthält und die Geschlechterverteilung aller Geschlechter als value. <br>Wird als Parameter <code>gender</code> übergeben, dann enthält der value nur die Häufigkeit des spezifizierten Geschlechts. <br>Wird als Parameter <code>name</code> übergeben, dann wird eine Json zurückgegeben, die nur den spezifizierten Beruf und die Geschlechterverteilung enthält. <br>Werden beide Parameter angegeben, wird eine Zahl zurückgegeben, die angibt, wie viele Personen des spezifizierten Geschlechts in dem Beruf gearbeitet haben. "
        }
    }
}